"""
Напишите класс Salary для расчета налогов на заработную плату. У класса должна быть обязательная переменная класса - процент налога от зарплаты - 15%. Объекты класса должны иметь сумму зарплаты и стаж работы в качестве атрибутов. Также у класса должен быть метод расчитывающий сумму налога заплаченного за весь стаж работы. Создайте экземпляр класса и посчитайте сумму вашего налога.
"""


# class Salary:
#     tax = 15*(100*0.1)

#     def __init__(self, salary, exp) -> None:
#       self.salary = salary
#       self.experience = exp
      
#     def sum_of_tax(self):
#       result = (self.salary * self.tax) * self.experience
#       print(f'Сумма налогов составила {result} сомов за {self.experience}')

# kalash = Salary(150_000, 10)
# kalash.sum_of_tax()




# class Song:
#   def __init__(self, author, title, year):
#     self.author = author
#     self.title = title
#     self.year = year

#   def show_author(self):
#     author = (f'Автор этой песни - {self.author}')
#     return author

#   def show_title(self):
#     title = (f'Название этой песни - {self.title}')
#     return title

#   def show_year(self):
#     year = (f'Дата выхода этой песни - {self.year}')
#     return year

# song1 = Song('Bakr', 'Uade', '2021')
# print(song1.show_author())
# print(song1.show_title())
# print(song1.show_year())
    