# Типы данных

# 1. NonType -> ничего, пустота
# 2. Boolean-> правда или ложь(true/false)
# 3. Числовые типы данных:
#     a) integer (int()) - целое число (1,2,3,..)
#     b) float() - числа с плавающей точкой (1.0222)
#     c) complex() - комплексные числа (большие числа)

# 4. Списковые типы данных:
#     a) list() (списки, массивы) -> [1,2,3] = изменяемые типы данных
# [3,4,True,None,'hello', "world", [12.2]]
#     b) tuple() (Кортежи) -> (1,2,3,4,5) = неизменяемые типы данных
#     c) range() (промежутки цифр) -> с Python3 является типом данных

# 5. str() -> Строки -> 'hello world', 'hello'
# """
# Чтобы сделать большой комент - используется эта команда 
# 'хз'

# """
# 6. set(Множества) -> {1,2,3,4,5,6, False}
#   frozenset - неизменяемое -> frozenset(.......)
# 7. dict(Словарь(объект)) - тип данных который хранит типы данных ввиде ключ:значение -> 
#     {1:"hello", 2: "tuple"}

#+++++++++++++++++++++++++++++++++++++++++++++++++====

# from types import NoneType
# from xmlrpc.client import Boolean


# Immutable(неизменяемые типы данных) Английская аудитория привыкла говорить не "типы данных", а "Object"
# 1. NoneType
# 2. Boolean
# 3. int()
# 4. complex()
# 5. float()
# 6. str()
# 7. tuple()
# 8. frozenset()
# 9. range()

# from typing import MutableSet, Set


# Mutable изменяемые

# 1. Set() {1.5.3}
# 2. list() [1,3,4,5]
# 3. dict() [1:True]

